performance/enterprise/test/qa-functional/data/TravelReservationService/TravelReservationServiceApplication/test/HasNoReservations/Input.xml

<SOAP-ENV:Envelope
  xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <TravelItinerary xmlns="http://www.opentravel.org/OTA/2003/05">
            <ItineraryRef Type="14" ID="M839LW">
                <UniqueID>M839LWNN</UniqueID>
            </ItineraryRef >
            <CustomerInfos>
                <CustomerInfo RPH="01">
                    <Customer>
                        <PersonName>
                            <NamePrefix>Mr.</NamePrefix>
                            <GivenName>Robert</GivenName>
                            <MiddleName>Anthony</MiddleName>
                            <Surname>Jones</Surname>
                        </PersonName>
                        <Telephone PhoneNumber="2241630" AreaCityCode="302" Extension="5574"/>
                        <Email>rajones@somewhere.org</Email>
                        <Address FormattedInd="true">
                            <StreetNmbr PO_Box="P.O. Box 77">1452 S. 13th St. N.W.</StreetNmbr>
                            <CityName>Westfinster</CityName>
                            <PostalCode>90210</PostalCode>
                            <StateProv>NY</StateProv>
                            <CountryName>US</CountryName>
                        </Address>
                    </Customer>
                    <AgencyAcctNumber Type="5" ID="UOTWT0122321"/>
                </CustomerInfo>
            </CustomerInfos>
            <ItineraryInfo>
                <ReservationItems ChronoOrdered="true"/>
                <Ticketing TicketType="eTicket" eTicketNumber="30465876954325" PlatingCarrier="UAL"/>
                <ItineraryPricing ItemRPH_List="01 02 03 04">
                    <Cost AmountAfterTax="745.00" CurrencyCode="USD"/>
                </ItineraryPricing>
                <SpecialRequestDetails>
                    <SpecialServiceRequests>
                        <SpecialServiceRequest FlightRefNumberRPHList="01" TravelerRefNumberRPHList="01" SSRCode="VGML">
                            <Airline Code="UA">United Airlines</Airline>
                        </SpecialServiceRequest>
                    </SpecialServiceRequests>
                </SpecialRequestDetails>
            </ItineraryInfo>
            <TravelCost>
                <FormOfPayment>
                    <PaymentCard CardNumber="3151002645983754" ExpireDate="1205" CardType="MC">
                        <CardHolderName>ROBERT A. JONES</CardHolderName>
                    </PaymentCard>
                </FormOfPayment>
                <CostTotals AmountAfterTax="1957.92" CurrencyCode="USD"/>
            </TravelCost>
            <UpdatedBy>
                <Access ID="U09932147"/>
            </UpdatedBy>
        </TravelItinerary>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
